#+BEGIN_EXPORT html
---
layout: post
title: Write Python programs
tagline: " by means of Emacs' toolbox"
permalink: /coding/codewars-toy-tasks.html
categories: [literate programming, Python, CodeWars, emacs]
tags: [coding, algorithms]
---
#+END_EXPORT

#+STARTUP: showall
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+TOC: headlines 2
#+PROPERTY:header-args :results output :exports both :eval never-export

** Solution
   #+BEGIN_SRC python :results output
     def getCount(inputStr):
         num_vowels = 0
         # your code here
         for letter in inputStr:
             list_of_vowels = ['a', 'e', 'i', 'o', 'u']
             if letter in list_of_vowels:
                 num_vowels += 1
                 #print(letter)
                 #print(num_vowels)
         return num_vowels

     input_string = 'John the dully boy write this book'

     print(getCount(input_string))
     assert(getCount(input_string) == 9)

   #+END_SRC

   #+RESULTS:
   : 9

*** Visualise the matrix of number's orders
    #+BEGIN_SRC python :results output :pp :exports both
      def simple_array():
       l = []
       for i in range(10):
	l.append([i] + [str(i**j)[-1] for j in range(10)])
       return l

      for i in simple_array():
       print(i)
    #+END_SRC

    #+RESULTS:
    #+begin_example
    [0, '1', '0', '0', '0', '0', '0', '0', '0', '0', '0']
    [1, '1', '1', '1', '1', '1', '1', '1', '1', '1', '1']
    [2, '1', '2', '4', '8', '6', '2', '4', '8', '6', '2']
    [3, '1', '3', '9', '7', '1', '3', '9', '7', '1', '3']
    [4, '1', '4', '6', '4', '6', '4', '6', '4', '6', '4']
    [5, '1', '5', '5', '5', '5', '5', '5', '5', '5', '5']
    [6, '1', '6', '6', '6', '6', '6', '6', '6', '6', '6']
    [7, '1', '7', '9', '3', '1', '7', '9', '3', '1', '7']
    [8, '1', '8', '4', '2', '6', '8', '4', '2', '6', '8']
    [9, '1', '9', '1', '9', '1', '9', '1', '9', '1', '9']
#+end_example

*** Predict sequence
    #+BEGIN_SRC python :results output :pp :exports both
      def seq0(num):
          return 0

      def seq1(num):
          return 1

      def seq2(num):
          if num > 0:
              s = [2, 4, 8, 6]
              if num < 5:
                  return s[num-1]
              else:
                  return s[num % 4 - 1]
          else:
              return 1

      assert(seq1(22) == 1)
      assert(seq0(100) == 0)
      assert(seq2(2) == 4)
      assert(seq2(4) == 6)
      assert(seq2(5) == 2)
      assert(seq2(10) == 4)
      print('Tests passed')
    #+END_SRC

    #+RESULTS:
    : Tests passed

*** Function generator
    #+BEGIN_SRC  python :results output :pp :exports both
      def first(n):
          return n + 1

      def second(n):
          return n + 2

      def function_generator(k, n):
          list_of_functions = [first(n), second(n)]
          return list_of_functions[k]

      print(function_generator(0, 10))
    #+END_SRC

    #+RESULTS:
    : 11

*** Ties these snippets together
    #+BEGIN_SRC python :results output :pp :exports both
      def seq0(num):
          return 0

      def seq1(num):
          return 1

      def seq2(num):
          if num > 0:
              s = [2, 4, 8, 6]
              if num < 5:
                  return s[num-1]
              else:
                  return s[num % 4 - 1]
          else:
              return 1

      def func_gen(k, n):
          list_of_functions = [seq0(n), seq1(n), seq2(n)]
          return list_of_functions[k]

      assert(func_gen(2, 10) == 4)
      print('It works!')
    #+END_SRC

    #+RESULTS:
    : It works!

*** Function itself
    #+BEGIN_SRC python :results output :pp :exports both
      def seq0(num):
          return 0

      def seq1(num):
          return 1

      def seq2(num):
          if num > 0:
              s = [2, 4, 8, 6]
              if num < 5:
                  return s[num-1]
              else:
                  return s[num % 4 - 1]
          else:
              return 1

      def last_digit(k, n):
          list_of_functions = [seq0(n), seq1(n), seq2(n)]
          return list_of_functions[k]

      assert(last_digit(2, 10) == 4)
      print('It works!')
      assert(last_digit(2, 11) == 8)
      assert(last_digit(1, 10) == 1)
      print('It works! also')
    #+END_SRC

    #+RESULTS:
    : It works!
    : It works! also

** Appropriate solution format
   #+BEGIN_SRC python :results output
     def extract_parentheses(string):
         if string:
             return [i for i in string if i in '[]{}()']
         else:
             return False

     def pair(parentheses):
         if parentheses == ')':
             return '('
         elif parentheses == ']':
             return '['
         elif parentheses == '}':
             return '{'
         else:
             return False

     def valid_parentheses(string):
         if string == "":
             return True
         else:
             opening = []
             closing = []
             parentheses = extract_parentheses(string)
             if parentheses and len(parentheses) % 2 == 0:
                 for i in parentheses:
                     print(opening, closing)
                     if not pair(i):
                         opening.append(i)
                         print("this is an opening sequence: ", opening)
                     else:
                         try:
                             opening[-1]
                         except IndexError:
                             return False
                         if opening[-1] == pair(i):
                             # annihilate them both
                             try:
                                 opening.pop()
                             except IndexError:
                                 return False
                         else:
                             # print("The closing parentheses mismatch")
                             # return False
                             closing.append(i)
                 if opening == [] and closing == []:
                     return True
                 else:
                     print('Mismatch in parentheses order')
                     return False
             else:
                 return False

     # print(valid_parentheses("hi())("))
     # assert(extract_parentheses(")test") == [')'])
     assert(pair(')') == '(')
     assert(valid_parentheses("  (") == False)
     assert(valid_parentheses(")test") == False)
     assert(valid_parentheses("") == True)
     assert(valid_parentheses("()()") == True)
     assert(valid_parentheses("hi())(") == False)
     assert(valid_parentheses("hi(hi)()") == True)
     assert(valid_parentheses("[(])") == False)
   #+END_SRC

   #+RESULTS:
   #+begin_example
   [] []
   this is an opening sequence:  ['(']
   ['('] []
   [] []
   this is an opening sequence:  ['(']
   ['('] []
   [] []
   this is an opening sequence:  ['(']
   ['('] []
   [] []
   [] []
   this is an opening sequence:  ['(']
   ['('] []
   [] []
   this is an opening sequence:  ['(']
   ['('] []
   [] []
   this is an opening sequence:  ['[']
   ['['] []
   this is an opening sequence:  ['[', '(']
   ['[', '('] []
   ['[', '('] [']']
   Mismatch in parentheses order
#+end_example

** Solution
   #+BEGIN_SRC python :results output
     def f2(k):
         return 2 * k + 1

     def f3(k):
         return 3 * k + 1

     def visualize(n):
         result = [1]
         while len(result) < n:
             result.append(f2(result[-1]))
             result.append(f3(result[-2]))
             result.append(f2(result[-2]))
             result.append(f2(result[-2]))
             result.append(f3(result[-4]))
             result.append(f3(result[-4]))
             result.append(f2(result[-4]))
             result.append(f2(result[-4]))

             # result = [1]
         # for i in range(n)[1:]:
         #     result.append(f2(i))
         #     result.append(f3(i))
         return result

     def dbl_linear(n):
         """
         y = 2 * x + 1 and z = 3 * x + 1
         u = [1, 3, 4, 7, 9, 10, 13, 15, 19, 21, 22, 27, ...]
         u[1, 3, 5 ...] = function(2)
         u[2, 4, 6 ...] = function(3) 
         """
         if n != 0:
             if n % 2:
                 # result is function of 3
                 k = n // 3
             else:
                 # result is function of 2
                 pass
         else:
             return 1



     print(visualize(5))
     u = [1, 3, 4, 7, 9, 10, 13, 15, 19, 21, 22, 27]
     assert(u[10] == 22)
     assert(dbl_linear(0) == 1)
     # assert(dbl_linear(10) == 22)
   #+END_SRC

   #+RESULTS:
   : [1, 3, 4, 5, 7, 7, 10, 9, 13, 11, 16, 13, 19, 15, 22, 17, 25, 19, 28]
